# Використаємо офіційний образ Python
FROM python:3.12-slim
# Образ - це щось типу архіву з усіи середовищем. python:3.12-slim - базовий образ - це вже готовий образ з операційною системою і пайтоном, на основі цього будується власний.
#Мінімальна збірка - образ, де все тільки необхідне, без програм, які використовують допоміжну технічну функцію (маленької програми для конкретного завдання)
#Тобто базовий образ Python 3.12 у мнімальній збірці (щоб контейнер був легшим)

# Встановимо робочу директорію(=папка на комп'ютері) всередині контейнера, всі дії будуть у папці /app
WORKDIR /app

# Скопіюємо requirements.txt (команда копює файл requirements.txt у контейнер (папку /app))
COPY requirements.txt .

# Встановимо бібліотеки (залежності з requirements.txt, без кешу)
RUN pip install --no-cache-dir -r requirements.txt
#залежності - це бібліотеки (зовнішні) (beautifulsoup4)
#RUN запускає команду pip install - встановлює біблотеки, --no-cache-dir - не зберігати пакети в кеші, тимчасовій пам'яті, -r - requirements, посилає на файл

# Скопіюємо код у контейнер
COPY rozetka_notebooks_scraper.py .

# Flask
CMD ["python", "app.py"]

# Команда за замовчуванням
ENTRYPOINT ["python", "rozetka_notebooks_scraper.py"]
# ENTRYPOINT - команда каже докеру, що те, що в дужках запускати всередині контейнера за замовчуванням, автоматично, без додаткових команд